# SetBlue Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ColorWithTransparency..::..SetBlue Method
ColorWithTransparency Class See Also
---
set blue
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public void SetBlue(
	uint blue
)
```

Visual Basic
---
```text
Public Sub SetBlue ( _
	blue As UInteger _
)
```

Visual C++
---
```text
public:
void SetBlue(
	unsigned int blue
)
```

# ### Parameters
blue
    Type: System..::..UInt32 blue
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | The value is not valid. The valid range is 0 to 255. |

# See Also
ColorWithTransparency Class
Autodesk.Revit.DB Namespace